{
  "irVersion": "6",
  "producerName": "AutoOptimizer",
  "producerVersion": "alpha",
  "domain": "",
  "modelVersion": "0",
  "graph": {
    "node": [
      {
        "input": [
          "boxes_all",
          "onnx::Reshape_1738"
        ],
        "output": [
          "onnx::Cast_1739"
        ],
        "name": "Reshape_1198",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "scores_all",
          "onnx::Reshape_1741"
        ],
        "output": [
          "onnx::Cast_1742"
        ],
        "name": "Reshape_1201",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1739"
        ],
        "output": [
          "bboxes"
        ],
        "name": "Cast_1199",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "10",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1742"
        ],
        "output": [
          "scores"
        ],
        "name": "Cast_1202",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "10",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "bboxes",
          "scores"
        ],
        "output": [
          "onnx::Cast_1744",
          "onnx::Cast_1745",
          "onnx::Cast_1746",
          "1747"
        ],
        "name": "BatchMultiClassNMS_1203",
        "opType": "BatchMultiClassNMS",
        "attribute": [
          {
            "name": "iou_threshold",
            "f": 0.5,
            "type": "FLOAT"
          },
          {
            "name": "max_size_per_class",
            "i": "200",
            "type": "INT"
          },
          {
            "name": "max_total_size",
            "i": "100",
            "type": "INT"
          },
          {
            "name": "score_threshold",
            "f": 0.05,
            "type": "FLOAT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1744"
        ],
        "output": [
          "onnx::Reshape_1748"
        ],
        "name": "Cast_1204",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1745"
        ],
        "output": [
          "onnx::Reshape_1749"
        ],
        "name": "Cast_1205",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1746"
        ],
        "output": [
          "onnx::Reshape_1750"
        ],
        "name": "Cast_1206",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Reshape_1748",
          "onnx::Reshape_1751"
        ],
        "output": [
          "onnx::Concat_1752"
        ],
        "name": "Reshape_1208",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "onnx::Reshape_1749",
          "onnx::Reshape_1753"
        ],
        "output": [
          "onnx::Concat_1754"
        ],
        "name": "Reshape_1210",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "onnx::Reshape_1750",
          "onnx::Reshape_1756"
        ],
        "output": [
          "output1"
        ],
        "name": "Reshape_1213",
        "opType": "Reshape",
        "domain": ""
      },
      {
        "input": [
          "onnx::Concat_1752",
          "onnx::Concat_1754"
        ],
        "output": [
          "onnx::Slice_1755"
        ],
        "name": "Concat_1211",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "-1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Slice_1755",
          "onnx::Gather_1764"
        ],
        "output": [
          "output2"
        ],
        "name": "Gather_1221",
        "opType": "Gather",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "onnx::Slice_1755",
          "onnx::Slice_1759",
          "onnx::Slice_1760",
          "onnx::Slice_1758",
          "onnx::Slice_1761"
        ],
        "output": [
          "onnx::Cast_1762"
        ],
        "name": "Slice_1218",
        "opType": "Slice",
        "domain": ""
      },
      {
        "input": [
          "onnx::Cast_1762"
        ],
        "output": [
          "output0"
        ],
        "name": "Cast_1219",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "extracted graph",
    "initializer": [
      {
        "dims": [
          "4"
        ],
        "dataType": 7,
        "name": "onnx::Reshape_1738",
        "rawData": "AQAAAAAAAADoAwAAAAAAAP//////////BAAAAAAAAAA="
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "name": "onnx::Reshape_1753",
        "rawData": "//////////8BAAAAAAAAAA=="
      },
      {
        "dataType": 7,
        "name": "onnx::Gather_1764",
        "rawData": "BAAAAAAAAAA="
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "name": "onnx::Reshape_1751",
        "rawData": "//////////8EAAAAAAAAAA=="
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "name": "onnx::Reshape_1756",
        "rawData": "//////////8BAAAAAAAAAA=="
      },
      {
        "dims": [
          "3"
        ],
        "dataType": 7,
        "name": "onnx::Reshape_1741",
        "rawData": "AQAAAAAAAADoAwAAAAAAAP//////////"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "onnx::Slice_1759",
        "rawData": "AAAAAAAAAAA="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "onnx::Slice_1760",
        "rawData": "BAAAAAAAAAA="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "onnx::Slice_1758",
        "rawData": "AQAAAAAAAAA="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "onnx::Slice_1761",
        "rawData": "AQAAAAAAAAA="
      }
    ],
    "input": [
      {
        "name": "boxes_all",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1000"
                },
                {
                  "dimValue": "80"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "scores_all",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1000"
                },
                {
                  "dimValue": "80"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "output0",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "output0_dynamic_axes_1"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "output2",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "output2_dynamic_axes_1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "output1",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {
                  "dimParam": "output1_dynamic_axes_1"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      }
    ],
    "valueInfo": [
      {
        "name": "onnx::Cast_1739",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1000"
                },
                {
                  "dimParam": "unk__72"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "bboxes",
        "type": {
          "tensorType": {
            "elemType": 10,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1000"
                },
                {
                  "dimParam": "unk__72"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "scores",
        "type": {
          "tensorType": {
            "elemType": 10,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1000"
                },
                {
                  "dimParam": "unk__53"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Concat_1752",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "unk__73"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Concat_1754",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "unk__74"
                },
                {
                  "dimValue": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Cast_1742",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimValue": "1"
                },
                {
                  "dimValue": "1000"
                },
                {
                  "dimParam": "unk__53"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Reshape_1749",
        "type": {
          "tensorType": {
            "elemType": 1
          }
        }
      },
      {
        "name": "onnx::Slice_1755",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "unk__73"
                },
                {
                  "dimValue": "5"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Reshape_1748",
        "type": {
          "tensorType": {
            "elemType": 1
          }
        }
      },
      {
        "name": "onnx::Reshape_1750",
        "type": {
          "tensorType": {
            "elemType": 7
          }
        }
      },
      {
        "name": "onnx::Slice_1755",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "unk__73"
                },
                {
                  "dimValue": "5"
                }
              ]
            }
          }
        }
      },
      {
        "name": "onnx::Cast_1762",
        "type": {
          "tensorType": {
            "elemType": 1,
            "shape": {
              "dim": [
                {
                  "dimParam": "unk__73"
                },
                {
                  "dimValue": "4"
                }
              ]
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "version": "11"
    }
  ]
}